name: Detect Possible DCSync Attack
id: a1db74c3-8455-4db1-99be-dacba2546c15
version: 1
date: '2022-11-26'
author: Steven Dick
type: Correlation
datamodel: []
description: This search looks for evidence of unexpected access to the "Replication Directory Changes" set of GUIDs in Active Directory. 

Typically access to these permissions is only seen during Domain Controller replication activity. 
Any detections from non-domain controller source may indicate the usage of "DCSync" credential dumping techniques. 

https://adsecurity.org/?p=1729
https://attack.mitre.org/techniques/T1003/006/
search: '`wineventlog_security` EventCode=4662 Properties IN (
"*Replicating Directory Changes All*",
"*DS-Install-Replica*",
"*DS-Replication-Get*",
"*89e95b76-444d-4c62-991a-0facbeda640c*",
"*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2*",
"*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*",
)
| stats count latest(Properties) as object latest(object_file_name) as object_file_name min(_time) as firstTime max(_time) as lastTime 
values(EventCode) as signature by src_user,dest  
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)`
| `detect_possible_dcsync_attack_filter`'
how_to_implement: To successfully implement this detection you must ingest Windows EventID 4662 from environment domain
controllers. Enable "Audit Directory Service Access" on domain controllers to log this event.

Caution this event is known to be high-volume, recommend post-implementation filtering at the Forwarding layer.
known_false_positives: Addition of legitimate replication accounts, usage of some legitimate admin tools (DCInternals)
references:
- https://adsecurity.org/?p=1729
- https://attack.mitre.org/techniques/T1003/006/
tags:
  analytic_story:
  - Active Directory Replication Attacks   
  - Credential Dumping
  asset_type: Endpoint
  cis20:
  - CIS 4
  - CIS 5
  - CIS 6
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Credential Access
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.006/impacket/windows-security-xml.log
  impact: 90
  kill_chain_phases:
  - Exploitation
  - Actions on Objectives
  message: Unexpected replication GUID access observed between $src_user$ and $dest$. This could be indicative of credential dumping and should be investigated.
  mitre_attack_id:
  - T1003
  - T1003.006
  nist:
  - DE.CM
  observable:
  - name: src_user
    type: User
    role:
    - Attacker
  - name: dest
    type: Hostname
    role:
    - Victim 
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - EventCode
  - Properties
  - _time
  - src_user
  - dest
  risk_score: 90
  security_domain: endpoint
